{
  "knowledgeInfo.perfectForFirstContribution": "**Functional Purpose**: Description for tasks requiring no existing Exercism knowledge, encouraging new contributors.\n**UI Location**: Task Tooltip → Knowledge Info (below 'no existing knowledge' heading)\n**When Users See This**: When hovering over a task that requires no prior Exercism knowledge.\n**Technical Context**: Standard text; no special formatting.\n**Current English**: \"This task is perfect for people making their first contribution to Exercism. If you've been around a while, considering leaving this for someone new 🙂\"\n",
  "knowledgeInfo.littleBitAboutExercism": "**Functional Purpose**: Description for tasks requiring elementary Exercism knowledge.\n**UI Location**: Task Tooltip → Knowledge Info (below 'elementary knowledge' heading)\n**When Users See This**: When hovering over a task that requires elementary Exercism knowledge.\n**Technical Context**: Standard text; no special formatting.\n**Current English**: \"You'll need to know a little bit about how Exercism works, but you can work it out during this task. Perfect for first-time contributors.\"\n",
  "knowledgeInfo.keyPrinciplesOfArea": "**Functional Purpose**: Description for tasks requiring intermediate Exercism knowledge, detailing what is needed.\n**UI Location**: Task Tooltip → Knowledge Info (below 'intermediate knowledge' heading)\n**When Users See This**: When hovering over a task that requires intermediate Exercism knowledge.\n**Technical Context**: Variable `desc` must remain unchanged. This variable provides the description of the specific area or defaults to 'Exercism'.\n**Current English**: \"You'll need to know the key principles of this area to work on this task. If you're not familiar, you can learn while doing the task but you might need to put in a couple of hours of reading the docs to get up to speed.\"\n",
  "summary.exercism": "**Functional Purpose**: Fallback text for when a specific module description is unavailable.\n**UI Location**: Task Tooltip → Knowledge Info (part of descriptions for intermediate and advanced knowledge)\n**When Users See This**: When a task's specific module description is not available in the context of intermediate or advanced knowledge requirements.\n**Technical Context**: Standard text; no special formatting.\n**Current English**: \"this area\"\n",
  "knowledgeInfo.solidUnderstandingOfArea": "**Functional Purpose**: Description for tasks requiring advanced Exercism knowledge, detailing what is needed.\n**UI Location**: Task Tooltip → Knowledge Info (below 'advanced knowledge' heading)\n**When Users See This**: When hovering over a task that requires advanced Exercism knowledge.\n**Technical Context**: Variable `desc` must remain unchanged. This variable provides the description of the specific area or defaults to 'Exercism'.\n**Current English**: \"You'll need to have a solid understanding of this area to work on this task. If you don't, you'll probably need to pair up with someone more experienced to work on it.\"\n"
}
